fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтпускаБольше28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытийФормы
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
		
		Если Параметры.Свойство("Год") Тогда
			Объект.Год = Параметры.Год;
		КонецЕсли;
		// Исходный период
		Период.ДатаНачала = НачалоГода(Объект.Год);
		Период.ДатаОкончания = КонецГода(Объект.Год);
		
		Если Параметры.Свойство("ДанныеДляГанта") Тогда
			ДанныеСОсновнойФормы = ПолучитьИзВременногоХранилища(Параметры.ДанныеДляГанта);
			ЗаполнитьДиаграммуГанта(Диаграмма, ДанныеСОсновнойФормы, Период);
		КонецЕсли; 
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	&НаСервереБезКонтекста
	Процедура ЗаполнитьДиаграммуГанта(Диаграмма, ДанныеСОсновнойФормы, Период)
		
		// Получение данных по отпускам	
		
		// Заполнение диаграммы Ганта данными 
		Диаграмма.Обновление = Ложь;
		Диаграмма.Очистить(); 
		
		СерияОтпуск = Диаграмма.Серии.Добавить();
		СерияОтпуск.Текст = "Отпуск";
		
		СвязиТочек = Новый Соответствие;
		Для Каждого Запись Из ДанныеСОсновнойФормы Цикл 
			//Добавляем сотрудника как Точку 
			Сотрудник = Запись.Сотрудник;
			
			ТочкаСотрудник = СвязиТочек.Получить(Сотрудник);
			Если ТочкаСотрудник = Неопределено Тогда
				ТочкаСотрудник = Диаграмма.Точки.Добавить(); 
				ТочкаСотрудник.Текст = Сотрудник;
				СвязиТочек.Вставить(Сотрудник, ТочкаСотрудник);
			КонецЕсли;
			
			// Получение значения на пересечении Точек и Серий
			
			ЗначениеСотрудник = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
			
			
			// Создаем новый интервал
			Интервал = ЗначениеСотрудник.Добавить();
			Интервал.Начало = Запись.ДатаНачала;
			Интервал.Конец = Запись.ДатаОкончания;
			Интервал.Текст = "Отпуск"; 
			Интервал.Цвет = WebЦвета.Бирюзовый; 
		КонецЦикла;
		Диаграмма.Обновление = Истина;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
